MikroElektronika/core_packages/PIC/XC8/def/PIC16LF15313/mcu.h
// Register: LATA
#define LATA LATA
extern volatile unsigned char           LATA                __at(0x018);
#ifndef _LIB_BUILD
asm("LATA equ 018h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATA0                  :1;
        unsigned LATA1                  :1;
        unsigned LATA2                  :1;
        unsigned                        :1;
        unsigned LATA4                  :1;
        unsigned LATA5                  :1;
    };
} LATAbits_t;
extern volatile LATAbits_t LATAbits __at(0x018);
// bitfield macros
#define _LATA_LATA0_POSN                                    0x0
#define _LATA_LATA0_POSITION                                0x0
#define _LATA_LATA0_SIZE                                    0x1
#define _LATA_LATA0_LENGTH                                  0x1
#define _LATA_LATA0_MASK                                    0x1
#define _LATA_LATA1_POSN                                    0x1
#define _LATA_LATA1_POSITION                                0x1
#define _LATA_LATA1_SIZE                                    0x1
#define _LATA_LATA1_LENGTH                                  0x1
#define _LATA_LATA1_MASK                                    0x2
#define _LATA_LATA2_POSN                                    0x2
#define _LATA_LATA2_POSITION                                0x2
#define _LATA_LATA2_SIZE                                    0x1
#define _LATA_LATA2_LENGTH                                  0x1
#define _LATA_LATA2_MASK                                    0x4
#define _LATA_LATA4_POSN                                    0x4
#define _LATA_LATA4_POSITION                                0x4
#define _LATA_LATA4_SIZE                                    0x1
#define _LATA_LATA4_LENGTH                                  0x1
#define _LATA_LATA4_MASK                                    0x10
#define _LATA_LATA5_POSN                                    0x5
#define _LATA_LATA5_POSITION                                0x5
#define _LATA_LATA5_SIZE                                    0x1
#define _LATA_LATA5_LENGTH                                  0x1
#define _LATA_LATA5_MASK                                    0x20

// Register: ADRES
#define ADRES ADRES
extern volatile unsigned short          ADRES               __at(0x09B);
#ifndef _LIB_BUILD
asm("ADRES equ 09Bh");
#endif

// Register: ADRESL
#define ADRESL ADRESL
extern volatile unsigned char           ADRESL              __at(0x09B);
#ifndef _LIB_BUILD
asm("ADRESL equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
    struct {
        unsigned ADRESL0                :1;
        unsigned ADRESL1                :1;
        unsigned ADRESL2                :1;
        unsigned ADRESL3                :1;
        unsigned ADRESL4                :1;
        unsigned ADRESL5                :1;
        unsigned ADRESL6                :1;
        unsigned ADRESL7                :1;
    };
} ADRESLbits_t;
extern volatile ADRESLbits_t ADRESLbits __at(0x09B);
// bitfield macros
#define _ADRESL_ADRESL_POSN                                 0x0
#define _ADRESL_ADRESL_POSITION                             0x0
#define _ADRESL_ADRESL_SIZE                                 0x8
#define _ADRESL_ADRESL_LENGTH                               0x8
#define _ADRESL_ADRESL_MASK                                 0xFF
#define _ADRESL_ADRESL0_POSN                                0x0
#define _ADRESL_ADRESL0_POSITION                            0x0
#define _ADRESL_ADRESL0_SIZE                                0x1
#define _ADRESL_ADRESL0_LENGTH                              0x1
#define _ADRESL_ADRESL0_MASK                                0x1
#define _ADRESL_ADRESL1_POSN                                0x1
#define _ADRESL_ADRESL1_POSITION                            0x1
#define _ADRESL_ADRESL1_SIZE                                0x1
#define _ADRESL_ADRESL1_LENGTH                              0x1
#define _ADRESL_ADRESL1_MASK                                0x2
#define _ADRESL_ADRESL2_POSN                                0x2
#define _ADRESL_ADRESL2_POSITION                            0x2
#define _ADRESL_ADRESL2_SIZE                                0x1
#define _ADRESL_ADRESL2_LENGTH                              0x1
#define _ADRESL_ADRESL2_MASK                                0x4
#define _ADRESL_ADRESL3_POSN                                0x3
#define _ADRESL_ADRESL3_POSITION                            0x3
#define _ADRESL_ADRESL3_SIZE                                0x1
#define _ADRESL_ADRESL3_LENGTH                              0x1
#define _ADRESL_ADRESL3_MASK                                0x8
#define _ADRESL_ADRESL4_POSN                                0x4
#define _ADRESL_ADRESL4_POSITION                            0x4
#define _ADRESL_ADRESL4_SIZE                                0x1
#define _ADRESL_ADRESL4_LENGTH                              0x1
#define _ADRESL_ADRESL4_MASK                                0x10
#define _ADRESL_ADRESL5_POSN                                0x5
#define _ADRESL_ADRESL5_POSITION                            0x5
#define _ADRESL_ADRESL5_SIZE                                0x1
#define _ADRESL_ADRESL5_LENGTH                              0x1
#define _ADRESL_ADRESL5_MASK                                0x20
#define _ADRESL_ADRESL6_POSN                                0x6
#define _ADRESL_ADRESL6_POSITION                            0x6
#define _ADRESL_ADRESL6_SIZE                                0x1
#define _ADRESL_ADRESL6_LENGTH                              0x1
#define _ADRESL_ADRESL6_MASK                                0x40
#define _ADRESL_ADRESL7_POSN                                0x7
#define _ADRESL_ADRESL7_POSITION                            0x7
#define _ADRESL_ADRESL7_SIZE                                0x1
#define _ADRESL_ADRESL7_LENGTH                              0x1
#define _ADRESL_ADRESL7_MASK                                0x80

// Register: ADRESH
#define ADRESH ADRESH
extern volatile unsigned char           ADRESH              __at(0x09C);
#ifndef _LIB_BUILD
asm("ADRESH equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
    struct {
        unsigned ADRESH0                :1;
        unsigned ADRESH1                :1;
        unsigned ADRESH2                :1;
        unsigned ADRESH3                :1;
        unsigned ADRESH4                :1;
        unsigned ADRESH5                :1;
        unsigned ADRESH6                :1;
        unsigned ADRESH7                :1;
    };
} ADRESHbits_t;
extern volatile ADRESHbits_t ADRESHbits __at(0x09C);
// bitfield macros
#define _ADRESH_ADRESH_POSN                                 0x0
#define _ADRESH_ADRESH_POSITION                             0x0
#define _ADRESH_ADRESH_SIZE                                 0x8
#define _ADRESH_ADRESH_LENGTH                               0x8
#define _ADRESH_ADRESH_MASK                                 0xFF
#define _ADRESH_ADRESH0_POSN                                0x0
#define _ADRESH_ADRESH0_POSITION                            0x0
#define _ADRESH_ADRESH0_SIZE                                0x1
#define _ADRESH_ADRESH0_LENGTH                              0x1
#define _ADRESH_ADRESH0_MASK                                0x1
#define _ADRESH_ADRESH1_POSN                                0x1
#define _ADRESH_ADRESH1_POSITION                            0x1
#define _ADRESH_ADRESH1_SIZE                                0x1
#define _ADRESH_ADRESH1_LENGTH                              0x1
#define _ADRESH_ADRESH1_MASK                                0x2
#define _ADRESH_ADRESH2_POSN                                0x2
#define _ADRESH_ADRESH2_POSITION                            0x2
#define _ADRESH_ADRESH2_SIZE                                0x1
#define _ADRESH_ADRESH2_LENGTH                              0x1
#define _ADRESH_ADRESH2_MASK                                0x4
#define _ADRESH_ADRESH3_POSN                                0x3
#define _ADRESH_ADRESH3_POSITION                            0x3
#define _ADRESH_ADRESH3_SIZE                                0x1
#define _ADRESH_ADRESH3_LENGTH                              0x1
#define _ADRESH_ADRESH3_MASK                                0x8
#define _ADRESH_ADRESH4_POSN                                0x4
#define _ADRESH_ADRESH4_POSITION                            0x4
#define _ADRESH_ADRESH4_SIZE                                0x1
#define _ADRESH_ADRESH4_LENGTH                              0x1
#define _ADRESH_ADRESH4_MASK                                0x10
#define _ADRESH_ADRESH5_POSN                                0x5
#define _ADRESH_ADRESH5_POSITION                            0x5
#define _ADRESH_ADRESH5_SIZE                                0x1
#define _ADRESH_ADRESH5_LENGTH                              0x1
#define _ADRESH_ADRESH5_MASK                                0x20
#define _ADRESH_ADRESH6_POSN                                0x6
#define _ADRESH_ADRESH6_POSITION                            0x6
#define _ADRESH_ADRESH6_SIZE                                0x1
#define _ADRESH_ADRESH6_LENGTH                              0x1
#define _ADRESH_ADRESH6_MASK                                0x40
#define _ADRESH_ADRESH7_POSN                                0x7
#define _ADRESH_ADRESH7_POSITION                            0x7
#define _ADRESH_ADRESH7_SIZE                                0x1
#define _ADRESH_ADRESH7_LENGTH                              0x1
#define _ADRESH_ADRESH7_MASK                                0x80

// Register: ADCON0
#define ADCON0 ADCON0
extern volatile unsigned char           ADCON0              __at(0x09D);
#ifndef _LIB_BUILD
asm("ADCON0 equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GOnDONE                :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
        unsigned CHS5                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned CHS                    :6;
    };
} ADCON0bits_t;
extern volatile ADCON0bits_t ADCON0bits __at(0x09D);
// bitfield macros
#define _ADCON0_ADON_POSN                                   0x0
#define _ADCON0_ADON_POSITION                               0x0
#define _ADCON0_ADON_SIZE                                   0x1
#define _ADCON0_ADON_LENGTH                                 0x1
#define _ADCON0_ADON_MASK                                   0x1
#define _ADCON0_GOnDONE_POSN                                0x1
#define _ADCON0_GOnDONE_POSITION                            0x1
#define _ADCON0_GOnDONE_SIZE                                0x1
#define _ADCON0_GOnDONE_LENGTH                              0x1
#define _ADCON0_GOnDONE_MASK                                0x2
#define _ADCON0_CHS0_POSN                                   0x2
#define _ADCON0_CHS0_POSITION                               0x2
#define _ADCON0_CHS0_SIZE                                   0x1
#define _ADCON0_CHS0_LENGTH                                 0x1
#define _ADCON0_CHS0_MASK                                   0x4
#define _ADCON0_CHS1_POSN                                   0x3
#define _ADCON0_CHS1_POSITION                               0x3
#define _ADCON0_CHS1_SIZE                                   0x1
#define _ADCON0_CHS1_LENGTH                                 0x1
#define _ADCON0_CHS1_MASK                                   0x8
#define _ADCON0_CHS2_POSN                                   0x4
#define _ADCON0_CHS2_POSITION                               0x4
#define _ADCON0_CHS2_SIZE                                   0x1
#define _ADCON0_CHS2_LENGTH                                 0x1
#define _ADCON0_CHS2_MASK                                   0x10
#define _ADCON0_CHS3_POSN                                   0x5
#define _ADCON0_CHS3_POSITION                               0x5
#define _ADCON0_CHS3_SIZE                                   0x1
#define _ADCON0_CHS3_LENGTH                                 0x1
#define _ADCON0_CHS3_MASK                                   0x20
#define _ADCON0_CHS4_POSN                                   0x6
#define _ADCON0_CHS4_POSITION                               0x6
#define _ADCON0_CHS4_SIZE                                   0x1
#define _ADCON0_CHS4_LENGTH                                 0x1
#define _ADCON0_CHS4_MASK                                   0x40
#define _ADCON0_CHS5_POSN                                   0x7
#define _ADCON0_CHS5_POSITION                               0x7
#define _ADCON0_CHS5_SIZE                                   0x1
#define _ADCON0_CHS5_LENGTH                                 0x1
#define _ADCON0_CHS5_MASK                                   0x80
#define _ADCON0_CHS_POSN                                    0x2
#define _ADCON0_CHS_POSITION                                0x2
#define _ADCON0_CHS_SIZE                                    0x6
#define _ADCON0_CHS_LENGTH                                  0x6
#define _ADCON0_CHS_MASK                                    0xFC

// Register: ADCON1
#define ADCON1 ADCON1
extern volatile unsigned char           ADCON1              __at(0x09E);
#ifndef _LIB_BUILD
asm("ADCON1 equ 09Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPREF0                :1;
        unsigned ADPREF1                :1;
        unsigned                        :2;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADPREF                 :2;
        unsigned                        :2;
        unsigned ADCS                   :3;
    };
} ADCON1bits_t;
extern volatile ADCON1bits_t ADCON1bits __at(0x09E);
// bitfield macros
#define _ADCON1_ADPREF0_POSN                                0x0
#define _ADCON1_ADPREF0_POSITION                            0x0
#define _ADCON1_ADPREF0_SIZE                                0x1
#define _ADCON1_ADPREF0_LENGTH                              0x1
#define _ADCON1_ADPREF0_MASK                                0x1
#define _ADCON1_ADPREF1_POSN                                0x1
#define _ADCON1_ADPREF1_POSITION                            0x1
#define _ADCON1_ADPREF1_SIZE                                0x1
#define _ADCON1_ADPREF1_LENGTH                              0x1
#define _ADCON1_ADPREF1_MASK                                0x2
#define _ADCON1_ADCS0_POSN                                  0x4
#define _ADCON1_ADCS0_POSITION                              0x4
#define _ADCON1_ADCS0_SIZE                                  0x1
#define _ADCON1_ADCS0_LENGTH                                0x1
#define _ADCON1_ADCS0_MASK                                  0x10
#define _ADCON1_ADCS1_POSN                                  0x5
#define _ADCON1_ADCS1_POSITION                              0x5
#define _ADCON1_ADCS1_SIZE                                  0x1
#define _ADCON1_ADCS1_LENGTH                                0x1
#define _ADCON1_ADCS1_MASK                                  0x20
#define _ADCON1_ADCS2_POSN                                  0x6
#define _ADCON1_ADCS2_POSITION                              0x6
#define _ADCON1_ADCS2_SIZE                                  0x1
#define _ADCON1_ADCS2_LENGTH                                0x1
#define _ADCON1_ADCS2_MASK                                  0x40
#define _ADCON1_ADFM_POSN                                   0x7
#define _ADCON1_ADFM_POSITION                               0x7
#define _ADCON1_ADFM_SIZE                                   0x1
#define _ADCON1_ADFM_LENGTH                                 0x1
#define _ADCON1_ADFM_MASK                                   0x80
#define _ADCON1_ADPREF_POSN                                 0x0
#define _ADCON1_ADPREF_POSITION                             0x0
#define _ADCON1_ADPREF_SIZE                                 0x2
#define _ADCON1_ADPREF_LENGTH                               0x2
#define _ADCON1_ADPREF_MASK                                 0x3
#define _ADCON1_ADCS_POSN                                   0x4
#define _ADCON1_ADCS_POSITION                               0x4
#define _ADCON1_ADCS_SIZE                                   0x3
#define _ADCON1_ADCS_LENGTH                                 0x3
#define _ADCON1_ADCS_MASK                                   0x70

