MikroElektronika/core_packages/PIC/XC8/def/PIC16LF15313/mcu.h
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x1065);	// @ (0x20C * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x1066);	// @ (0x20C * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x1067);	// @ (0x20C * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE6<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x38E0);	// @ (0x71C * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR6,0)
// PMD3<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD3,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0xF508);	// @ (0x1EA1 * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0xF509);	// @ (0x1EA1 * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0xF50A);	// @ (0x1EA1 * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0xF50B);	// @ (0x1EA1 * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0xF50C);	// @ (0x1EA1 * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP1PPS<CCP1PPS5>
extern volatile __bit                   CCP1PPS5            __at(0xF50D);	// @ (0x1EA1 * 8 + 5)
#define                                 CCP1PPS5_bit        _BIT_ACCESS(CCP1PPS,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1897);	// @ (0x312 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1894);	// @ (0x312 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE6<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x38E1);	// @ (0x71C * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1890);	// @ (0x312 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1891);	// @ (0x312 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1892);	// @ (0x312 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1893);	// @ (0x312 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1895);	// @ (0x312 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP2PPS<CCP2PPS5>
extern volatile __bit                   CCP2PPS5            __at(0xF515);	// @ (0x1EA2 * 8 + 5)
#define                                 CCP2PPS5_bit        _BIT_ACCESS(CCP2PPS,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x4862);	// @ (0x90C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x4863);	// @ (0x90C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x4470);	// @ (0x88E * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x4471);	// @ (0x88E * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x4472);	// @ (0x88E * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x4473);	// @ (0x88E * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// ADCON0<CHS5>
extern volatile __bit                   CHS5                __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 CHS5_bit            _BIT_ACCESS(ADCON0,7)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0xC7E);	// @ (0x18F * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0xC7E);	// @ (0x18F * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0xC84);	// @ (0x190 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0xC84);	// @ (0x190 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// T2HLT<CKPOL>
extern volatile __bit                   CKPOL               __at(0x147E);	// @ (0x28F * 8 + 6)
#define                                 CKPOL_bit           _BIT_ACCESS(T2HLT,6)
// T2CON<CKPS2>
extern volatile __bit                   CKPS2               __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 CKPS2_bit           _BIT_ACCESS(T2CON,6)
// T2HLT<CKSYNC>
extern volatile __bit                   CKSYNC              __at(0x147D);	// @ (0x28F * 8 + 5)
#define                                 CKSYNC_bit          _BIT_ACCESS(T2HLT,5)
// PIE5<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x38DC);	// @ (0x71B * 8 + 4)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x388C);	// @ (0x711 * 8 + 4)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR5,4)
// PMD5<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x3CD9);	// @ (0x79B * 8 + 1)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD5,1)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x38DD);	// @ (0x71B * 8 + 5)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x388D);	// @ (0x711 * 8 + 5)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,5)
// PMD5<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD5,2)
// PIE5<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x38DE);	// @ (0x71B * 8 + 6)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x388E);	// @ (0x711 * 8 + 6)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR5,6)
// PMD5<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x3CDB);	// @ (0x79B * 8 + 3)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD5,3)
// PIE5<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x38DF);	// @ (0x71B * 8 + 7)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x388F);	// @ (0x711 * 8 + 7)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR5,7)
// PMD5<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x3CDC);	// @ (0x79B * 8 + 4)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD5,4)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0xF5D8);	// @ (0x1EBB * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0xF5D9);	// @ (0x1EBB * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0xF5DA);	// @ (0x1EBB * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0xF5DB);	// @ (0x1EBB * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0xF5DC);	// @ (0x1EBB * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN0PPS<CLCIN0PPS5>
extern volatile __bit                   CLCIN0PPS5          __at(0xF5DD);	// @ (0x1EBB * 8 + 5)
#define                                 CLCIN0PPS5_bit      _BIT_ACCESS(CLCIN0PPS,5)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0xF5E0);	// @ (0x1EBC * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0xF5E1);	// @ (0x1EBC * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0xF5E2);	// @ (0x1EBC * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0xF5E3);	// @ (0x1EBC * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0xF5E4);	// @ (0x1EBC * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN1PPS<CLCIN1PPS5>
extern volatile __bit                   CLCIN1PPS5          __at(0xF5E5);	// @ (0x1EBC * 8 + 5)
#define                                 CLCIN1PPS5_bit      _BIT_ACCESS(CLCIN1PPS,5)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0xF5E8);	// @ (0x1EBD * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0xF5E9);	// @ (0x1EBD * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0xF5EA);	// @ (0x1EBD * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0xF5EB);	// @ (0x1EBD * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0xF5EC);	// @ (0x1EBD * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN2PPS<CLCIN2PPS5>
extern volatile __bit                   CLCIN2PPS5          __at(0xF5ED);	// @ (0x1EBD * 8 + 5)
#define                                 CLCIN2PPS5_bit      _BIT_ACCESS(CLCIN2PPS,5)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0xF5F0);	// @ (0x1EBE * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0xF5F1);	// @ (0x1EBE * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0xF5F2);	// @ (0x1EBE * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0xF5F3);	// @ (0x1EBE * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0xF5F4);	// @ (0x1EBE * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN3PPS<CLCIN3PPS5>
extern volatile __bit                   CLCIN3PPS5          __at(0xF5F5);	// @ (0x1EBE * 8 + 5)
#define                                 CLCIN3PPS5_bit      _BIT_ACCESS(CLCIN3PPS,5)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x44B0);	// @ (0x896 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x44B1);	// @ (0x896 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x44B2);	// @ (0x896 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x44B3);	// @ (0x896 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x44AB);	// @ (0x895 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x44AC);	// @ (0x895 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x44A8);	// @ (0x895 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x44A9);	// @ (0x895 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x44AA);	// @ (0x895 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x44AF);	// @ (0x895 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x4474);	// @ (0x88E * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x4475);	// @ (0x88E * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x4476);	// @ (0x88E * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// CWG1CLKCON<CS>
extern volatile __bit                   CS                  __at(0x3060);	// @ (0x60C * 8 + 0)
#define                                 CS_bit              _BIT_ACCESS(CWG1CLKCON,0)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0x8F7);	// @ (0x11E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x447F);	// @ (0x88F * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE1<CSWIE>
extern volatile __bit                   CSWIE               __at(0x38BE);	// @ (0x717 * 8 + 6)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE1,6)
// PIR1<CSWIF>
extern volatile __bit                   CSWIF               __at(0x386E);	// @ (0x70D * 8 + 6)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR1,6)
// CWG1CLKCON<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x3060);	// @ (0x60C * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLKCON,0)
// CWG1DAT<CWG1DAT0>
extern volatile __bit                   CWG1DAT0            __at(0x3068);	// @ (0x60D * 8 + 0)
#define                                 CWG1DAT0_bit        _BIT_ACCESS(CWG1DAT,0)
// CWG1DAT<CWG1DAT1>
extern volatile __bit                   CWG1DAT1            __at(0x3069);	// @ (0x60D * 8 + 1)
